ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/mpu.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2013, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// mpu.c - Driver for the mpu Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup mpu_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_MPU__
#include "mpu.h"

#include <assert.h>

//*****************************************************************************
//
// The following value is used by createTwoSegments, createThreeSegments to
// check the user has passed a valid segmentation value. This value was
// obtained from the User's Guide.
//
//*****************************************************************************
#define MPU_MAX_SEG_VALUE                                                0x13C1

//*****************************************************************************
//
//! This function creates two memory segments in FRAM allowing the user to set
//! access right to each segment. To set the correct value for seg1boundary,
//! the user must consult the Device Family User's Guide and provide the MPUSBx
//! value corresponding to the memory address where the user wants to create
//! the partition. Consult the "Segment Border Setting" section in the User's
//! Guide to find the options available for MPUSBx.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param seg1boundary Valid values can be found in the Family User's Guide
//!        Valid values are:
//!        - \b MPU_Range of 0x4000 - 0x13C0
//! \param seg1accmask is the bit mask of access right for memory segment 1.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//! \param seg2accmask is the bit mask of access right for memory segment 2
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//!
//! Modified bits of \b MPUSAM register, bits of \b MPUSEG register and bits of
//! \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_createTwoSegments(uint32_t baseAddress,
                           uint16_t seg1boundary,
                           uint8_t seg1accmask,
                           uint8_t seg2accmask
                           )
{

        // Verify access right mask for segment1 is a valid selection
        assert((seg1accmask < MPUSEG1VS) && ((seg1accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                                             (seg1accmask == (MPU_EXEC | MPU_READ)) ||
                                             (seg1accmask == (MPU_READ | MPU_WRITE)) ||
                                             (seg1accmask == (MPU_READ))));

        // Verify access right mask for segment2 is a valid selection
        assert((seg2accmask < MPUSEG1VS) && ((seg2accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                                             (seg2accmask == (MPU_EXEC | MPU_READ)) ||
                                             (seg2accmask == (MPU_READ | MPU_WRITE)) ||
                                             (seg2accmask == (MPU_READ))));

        // Write MPU password to allow MPU register configuration
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;

        // Verify segment1 boundary is valid selection
        assert(seg1boundary < MPU_MAX_SEG_VALUE);

        // Create two memory segmentations
        HWREG16(baseAddress + OFS_MPUSEGB1) = seg1boundary;
        HWREG16(baseAddress + OFS_MPUSEGB2) = seg1boundary;

        // Set access rights based on user's selection for segment1
        switch (seg1accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1XE + MPUSEG1RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE + MPUSEG1WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG1XE + MPUSEG1WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE;
                break;
        default:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG1XE + MPUSEG1WE + MPUSEG1RE);
                break;
        }

        // Set access rights based on user's selection for segment2
        switch (seg2accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3WE + MPUSEG2WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3XE + MPUSEG3RE +
                                                     MPUSEG2XE + MPUSEG2RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3XE + MPUSEG2XE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE + MPUSEG3WE +
                                                     MPUSEG2RE + MPUSEG2WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3XE + MPUSEG3WE +
                                                       MPUSEG2XE + MPUSEG2WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE + MPUSEG2RE;
                break;
        default:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG3XE + MPUSEG3WE +
                                                      MPUSEG3RE + MPUSEG2XE + MPUSEG2WE + MPUSEG2RE);
                break;
        }

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! This function creates three memory segments in FRAM allowing the user to
//! set access right to each segment. To set the correct value for
//! seg1boundary, the user must consult the Device Family User's Guide and
//! provide the MPUSBx value corresponding to the memory address where the user
//! wants to create the partition. Consult the "Segment Border Setting" section
//! in the User's Guide to find the options available for MPUSBx.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param seg1boundary Valid values can be found in the Family User's Guide
//!        Valid values are:
//!        - \b MPU_Range of 0x4000 - 0x13C0
//! \param seg2boundary Valid values can be found in the Family User's Guide
//!        Valid values are:
//!        - \b MPU_Range of 0x4000 - 0x13C0
//! \param seg1accmask is the bit mask of access right for memory segment 1.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//! \param seg2accmask is the bit mask of access right for memory segment 2.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//! \param seg3accmask is the bit mask of access right for memory segment 3.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//!
//! Modified bits of \b MPUSAM register, bits of \b MPUSEG register and bits of
//! \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_createThreeSegments(uint32_t baseAddress,
                             uint16_t seg1boundary,
                             uint16_t seg2boundary,
                             uint8_t seg1accmask,
                             uint8_t seg2accmask,
                             uint8_t seg3accmask
                             )
{

        // Verify access right mask for segment1 is a valid selection
        assert((seg1accmask < MPUSEG1VS) && ((seg1accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                                             (seg1accmask == (MPU_EXEC | MPU_READ)) ||
                                             (seg1accmask == (MPU_READ | MPU_WRITE)) ||
                                             (seg1accmask == (MPU_READ))));

        // Verify access right mask for segment2 is a valid selection
        assert((seg2accmask < MPUSEG1VS) && ((seg2accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                                             (seg2accmask == (MPU_EXEC | MPU_READ)) ||
                                             (seg2accmask == (MPU_READ | MPU_WRITE)) ||
                                             (seg2accmask == (MPU_READ))));

        // Verify access right mask for segment3 is a valid selection
        assert((seg3accmask < MPUSEG1VS) && ((seg3accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                                             (seg3accmask == (MPU_EXEC | MPU_READ)) ||
                                             (seg3accmask == (MPU_READ | MPU_WRITE)) ||
                                             (seg3accmask == (MPU_READ))));

