ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/mpu.c
        // Write MPU password to allow MPU register configuration
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;

        // Verify segment1 boundary is valid selection
        assert(seg1boundary < MPU_MAX_SEG_VALUE);

        // Create two memory segmentations
        HWREG16(baseAddress + OFS_MPUSEGB1) = seg1boundary;
        HWREG16(baseAddress + OFS_MPUSEGB2) = seg2boundary;

        // Set access rights based on user's selection for segment1
        switch (seg1accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1XE + MPUSEG1RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE + MPUSEG1WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG1XE + MPUSEG1WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE;
                break;
        default:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG1XE + MPUSEG1WE + MPUSEG1RE);
                break;
        }

        // Set access rights based on user's selection for segment2
        switch (seg2accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG2WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2XE + MPUSEG2RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG2XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2RE + MPUSEG2WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG2XE + MPUSEG2WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2RE;
                break;
        default:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG2XE + MPUSEG2WE + MPUSEG2RE);
                break;
        }

        // Set access rights based on user's selection for segment3
        switch (seg3accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG3WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3XE + MPUSEG3RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG3XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE + MPUSEG3WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3XE + MPUSEG3WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE;
                break;
        default:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG3XE + MPUSEG3WE + MPUSEG3RE);
                break;
        }

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function enables the NMI Event if a Segment violation
//! has occurred.
//!
//! \param baseAddress is the base address of the MPU module.
//!
//! Modified bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_enableNMIevent(uint32_t baseAddress)
{
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW + MPUSEGIE;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function enables the MPU module in the device.
//!
//! This function needs to be called once all memory segmentation has been
//! done. If this function is not called the MPU module will not be activated.
//!
//! \param baseAddress is the base address of the MPU module.
//!
//! Modified bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_start(uint32_t baseAddress)
{
        if (HWREG16(baseAddress + OFS_MPUCTL0) & MPUSEGIE)
                HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW  | MPUSEGIE | MPUENA;
        else
                HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW  | MPUENA;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function enables PUC generation when an access
//! violation has Occurred on the memory segment selected by the user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param segment is the bit mask of memory segment that will generate a PUC
//!        when an access violation occurs.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_FIRST_SEG - PUC generation on first memory segment
//!        - \b MPU_SECOND_SEG - PUC generation on second memory segment
//!        - \b MPU_THIRD_SEG - PUC generation on third memory segment
//!
//! Modified bits of \b MPUSAM register and bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_enablePUCOnViolation(uint32_t baseAddress,
                              uint16_t segment
                              )
{
        // Verify user has selected a valid memory segment
        assert(0x00 != (segment & (MPU_FIRST_SEG + MPU_SECOND_SEG + MPU_THIRD_SEG)));

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;
        HWREG16(baseAddress + OFS_MPUSAM) |= segment;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function disables PUC generation when an access
//! violation has Occurred on the memory segment selected by the user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param segment is the bit mask of memory segment that will NOT generate a
//!        PUC when an access violation occurs.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_FIRST_SEG - PUC generation on first memory segment
//!        - \b MPU_SECOND_SEG - PUC generation on second memory segment
//!        - \b MPU_THIRD_SEG - PUC generation on third memory segment
//!
//! Modified bits of \b MPUSAM register and bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_disablePUCOnViolation(uint32_t baseAddress,
                               uint16_t segment
                               )
{
        // Verify user has selected a valid memory segment
        assert(0x00 != (segment & (MPU_FIRST_SEG + MPU_SECOND_SEG + MPU_THIRD_SEG)));

