ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/mpu.c
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;
        HWREG16(baseAddress + OFS_MPUSAM) &= ~segment;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Returns the memory segment violation flag status requested by the
//! user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param memAccFlag is the is the memory access violation flag.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_SEG_1_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 1 is detected
//!        - \b MPU_SEG_2_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 2 is detected
//!        - \b MPU_SEG_3_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 3 is detected
//!
//! \return Logical OR of any of the following:
//!         - \b MPU_SEG_1_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 1 is detected
//!         - \b MPU_SEG_2_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 2 is detected
//!         - \b MPU_SEG_3_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 3 is detected
//!         \n indicating the status of the masked flags.
//
//*****************************************************************************
uint16_t MPU_getInterruptStatus(uint32_t baseAddress,
                                uint16_t memAccFlag
                                )
{
        return HWREG16(baseAddress + OFS_MPUCTL1) & memAccFlag;
}

//*****************************************************************************
//
//! \brief Clears the masked interrupt flags
//!
//! Returns the memory segment violation flag status requested by the user or
//! if user is providing a bit mask value, the function will return a value
//! indicating if all flags were cleared.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param memAccFlag is the is the memory access violation flag.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_SEG_1_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 1 is detected
//!        - \b MPU_SEG_2_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 2 is detected
//!        - \b MPU_SEG_3_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 3 is detected
//!
//! \return Logical OR of any of the following:
//!         - \b MPU_SEG_1_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 1 is detected
//!         - \b MPU_SEG_2_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 2 is detected
//!         - \b MPU_SEG_3_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 3 is detected
//!         \n indicating the status of the masked flags.
//
//*****************************************************************************
uint16_t MPU_clearInterruptFlag(uint32_t baseAddress,
                                uint16_t memAccFlag
                                )
{

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;
        HWREG16(baseAddress + OFS_MPUCTL1) &= ~memAccFlag;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;

        return HWREG16(baseAddress + OFS_MPUCTL1) & memAccFlag;
}

//*****************************************************************************
//
//! \brief Clears all Memory Segment Access Violation Interrupt Flags.
//!
//! \param baseAddress is the base address of the MPU module.
//!
//! Modified bits of \b MPUCTL1 register.
//!
//! \return Logical OR of any of the following:
//!         - \b MPU_SEG_1_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 1 is detected
//!         - \b MPU_SEG_2_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 2 is detected
//!         - \b MPU_SEG_3_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 3 is detected
//!         \n indicating the status of the interrupt flags.
//
//*****************************************************************************
uint16_t MPU_clearAllInterruptFlags(uint32_t baseAddress
                                    )
{

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW;
        HWREG16(baseAddress + OFS_MPUCTL1) &= ~(MPUSEG1IFG + MPUSEG2IFG + MPUSEG3IFG);

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;

        return HWREG16(baseAddress + OFS_MPUCTL1) & (MPUSEG1IFG + MPUSEG2IFG + MPUSEG3IFG);
}

//*****************************************************************************
//
//! \brief Lock MPU to protect from write access.
//!
//! Sets MPULOCK to protect MPU from write access on all MPU registers except
//! MPUCTL1, MPUIPC0 and MPUIPSEGBx until a BOR occurs. MPULOCK bit cannot be
//! cleared manually.
//!
//! \param baseAddress is the base address of the MPU module.
//!
//! Modified bits are \b MPULOCK of \b MPUCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_lockMPU(uint32_t baseAddress)
{
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | MPULOCK;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}
#endif
//*****************************************************************************
//
//! Close the doxygen group for mpu_api
//! @}
//
//*****************************************************************************
